<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;

class HomeController extends Controller
{
    public function home(){
        $questions = [
            "يستمتع ابني / ابنتي بالحديث معي.",
            "يستمتع ابني / ابنتي بعناقي أو تقبيلي.",
            " أشعر بالارتياح بوجودي مع ابني / ابنتي.",
            "أستمتع بإخبار أصدقائي عن ابني / ابنتي.",
            " أنا مصدر فخر لابني / ابنتي.",
            "يتفهم ابني / ابنتي مشاكلي ومخاوفي.",
            "أخبر ابني / ابنتي بمشاعري الحقيقية.",
            "أنا وابني / ابنتي نتناقش حول المشاكل التي تواجه/ها.",
            "يشعر ابني / ابنتي بالحرية في مناقشة الأمور الجنسية معي.",
            "يخبرني ابني / ابنتي بمشاعره الحقيقية.",
            "آخذ أفكار ابني / ابنتي على محمل الجد.",
            "يختار ابني / ابنتي ملابسه/ها دون الحاجة لمشورتي.",
            "يتخذ ابني / ابنتي القرارات دون مساعدتي.",
            " ابني / ابنتي هو من يبادر بالحديث مع الآخرين.",
            "يستطيع ابني / ابنتي حل مشاكله / مشاكلها دون مساعدتي.",
        ];
        return view('home',compact("questions"));
    }
    public function result(Request $req){
        $results = [
            "1" => [
                "ابنك يفتقد للترابط العاطفي بينكما، لربما يساعده أن يقوم الوالدين بضمه و احتضانه وقد يكون الابن بحاجة الى التحفيز ومدح خصاله الجيدة من والديه مما سيوطد الارتباط العاطفي بينكما ",
                "التواصل في علاقتكم يحتاج الى تطوير حيث أن الابن قد يحتاج الى مساحة من الانصات منك و التقدير لكلامه ليشجعه للتواصل معك و بدأ حوارات بينكما، حاول ان تشعر ابنك انه قريبا منك بمشاركتك اياه مشاعرك و بعض مشاكلك، مما سيدفعه لمشاركتك لمشاعره و مشاكله أيضا.",
                "يحتاج أن يدعمه الوالدين لاتخاذ بعض القرارت بنفسه من المهم أن يكون للابن استقلالية في هذا العمر حتى يستطيع أن يعتمد على نفسه في المستقبل، مهم جدا الا يقلل الوالدان من قراراته و يتجنبوا السخرية منه مع التوجيه ان لزم الأمر "
            ],
            "2" => [
                "ارتباطكم العاطفي جيد و ممكن أن يتطور بكلمات التشجيع و مدح خصاله الجيدة، معاملته بالرفق و الحنان سيزيد من ارتباطه العاطفي بك. ",
                "يحتاج التواصل بينكم لبعض الاهتمام، قد يحتاج الابن لمساحة أكبر للحديث معك و عليك أن تبدي اهتماما و انفتاحا أكثر ليزداد و يقوى التواصل بينكم، حاول ان تشعر ابنك انه قريبا منك بمشاركتك اياه مشاعرك و بعض مشاكلك، مما سيدفعه لمشاركتك لمشاعره و مشاكله أيضا.",
                "يحتاج ابنك لبعض الدعم لاتخاذ قرارات بنفسه و أن تشجعه على حل مشكلاته بنفسه مع التوجيه ان لزم الأمر،من المهم أن يكون للابن استقلالية في هذا العمر حتى يستطيع أن يعتمد على نفسه في المستقبل",
            ],
            "3" => [
                "ترابطك مع ابنك جيد، استمر بمدحه وتشجيعه، اهتم بضمه وباحتضانه و حاول أن تكون دائما مصدر فخر له. ",
                "مشاركة ابنك ستزيد من التواصل بينكما، اجعل ابنك يشعر أنك قريب منك.",
                "استمر في دعم ابنك لأخذ قرارات سليمة، و علمه تحمل مسؤولية قراراته، وجّهه حين يتطلب الأمر.",
            ]
        ];
        
        $total = 0;
        foreach($req->input() as $key => $input){
            if($key == "_token"){
                continue;
            }
            $total = $total + $input;

        }
        $score = $total/3;
        if($score < 3.5){
            $result = $results[1]; 
        }
        if($score >= 3.5 && $score < 7){
            $result = $results[2]; 
        }

        if($score >= 7){
            $result = $results[3]; 
        }
        return view('result',compact('result'));
    }
}
